Revit 2027 API
RailingType.PrimaryHandRailPosition Property
 The position of the primary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HandRailPosition PrimaryHandRailPosition { get; set; }
Public Property PrimaryHandRailPosition As HandRailPosition
	Get
	Set
public:
property HandRailPosition PrimaryHandRailPosition {
	HandRailPosition get ();
	void set (HandRailPosition value);
}
member PrimaryHandRailPosition : HandRailPosition with get, set
Property Value
HandRailPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The rail has no primary hand rail.
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace